#### Terraform run for Development`
#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

Terraform plan for Environment: Development
aws_vpc.this: Refreshing state... [id=vpc-02e8698509de39652]
data.aws_ami.amazon_ami: Reading...
aws_eip.nat_gateway[0]: Refreshing state... [id=eipalloc-098c47a2ea592999f]
aws_eip.nat_gateway[1]: Refreshing state... [id=eipalloc-09ea7c181a4330820]
aws_eip.nat_gateway[2]: Refreshing state... [id=eipalloc-09380b1b234ec78f2]
data.aws_ami.amazon_ami: Read complete after 1s [id=ami-0ec5c7d8262c1f6b2]
aws_subnet.private[0]: Refreshing state... [id=subnet-0265bac2e1e396c80]
aws_subnet.private[1]: Refreshing state... [id=subnet-062124640ef9edadf]
aws_route_table.public: Refreshing state... [id=rtb-00a9ac541bed394ee]
aws_subnet.private[2]: Refreshing state... [id=subnet-00b6ba38fa092a8df]
aws_internet_gateway.this-igw: Refreshing state... [id=igw-02e737728ec32f4a1]
aws_subnet.public[2]: Refreshing state... [id=subnet-0759ecad3049b4f3f]
aws_default_security_group.default: Refreshing state... [id=sg-08abc0f49d5940833]
aws_subnet.public[0]: Refreshing state... [id=subnet-0f82694406ebba720]
aws_subnet.public[1]: Refreshing state... [id=subnet-0d567ae41531d833e]
aws_security_group.lb: Refreshing state... [id=sg-0c7778f9d8eb60bc6]
aws_lb_target_group.front: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:113597678832:targetgroup/app-2-front/849b90ee9a926f24]
aws_route_table.private[2]: Refreshing state... [id=rtb-0e27ce3d9726e02ec]
aws_route_table.private[1]: Refreshing state... [id=rtb-0a7e726f16b4cc889]
aws_route_table.private[0]: Refreshing state... [id=rtb-0a0b4e1d09784c628]
aws_route.internet-route: Refreshing state... [id=r-rtb-00a9ac541bed394ee1080289494]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-03f0c26928f367b7a]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b7df31e6dd2b2690]
aws_security_group.ec2_instance: Refreshing state... [id=sg-00e597f240fa7809d]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-019a012cbc45f9164]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0445ff0baa05809e6]
aws_nat_gateway.public[0]: Refreshing state... [id=nat-00e868220f3c94c89]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0aa93cc269c592eef]
aws_lb.front: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:113597678832:loadbalancer/app/app-2-front/8b2bea3789d0055b]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0befedf51da8fca9c]
aws_nat_gateway.public[1]: Refreshing state... [id=nat-0fe0b0d001a5871fe]
aws_nat_gateway.public[2]: Refreshing state... [id=nat-0a241b02803ccc546]
aws_instance.app-server[2]: Refreshing state... [id=i-0d287ecf7b97c91bc]
aws_instance.app-server[0]: Refreshing state... [id=i-0f9cff72ccef9da75]
aws_instance.app-server[1]: Refreshing state... [id=i-076975b562ef20c5f]
aws_route.private-route[2]: Refreshing state... [id=r-rtb-0e27ce3d9726e02ec1080289494]
aws_route.private-route[0]: Refreshing state... [id=r-rtb-0a0b4e1d09784c6281080289494]
aws_route.private-route[1]: Refreshing state... [id=r-rtb-0a7e726f16b4cc8891080289494]
aws_lb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:113597678832:listener/app/app-2-front/8b2bea3789d0055b/8c208f89eb2502bc]
aws_lb_target_group_attachment.attach-app1[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:113597678832:targetgroup/app-2-front/849b90ee9a926f24-20230816163850990500000007]
aws_lb_target_group_attachment.attach-app1[2]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:113597678832:targetgroup/app-2-front/849b90ee9a926f24-20230816163851173400000008]
aws_lb_target_group_attachment.attach-app1[1]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:113597678832:targetgroup/app-2-front/849b90ee9a926f24-20230816163851229500000009]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_eip.nat_gateway[0] has changed
  ~ resource "aws_eip" "nat_gateway" {
      + association_id       = "eipassoc-08f78f62cf18dd9ff"
        id                   = "eipalloc-098c47a2ea592999f"
      + network_interface    = "eni-08fa06db25500cc13"
      + private_dns          = "ip-10-20-20-122.us-east-2.compute.internal"
      + private_ip           = "10.20.20.122"
      + tags                 = {}
        # (8 unchanged attributes hidden)
    }

  # aws_eip.nat_gateway[1] has changed
  ~ resource "aws_eip" "nat_gateway" {
      + association_id       = "eipassoc-0f9deebe37533ebc2"
        id                   = "eipalloc-09ea7c181a4330820"
      + network_interface    = "eni-0e360c9517425ad88"
      + private_dns          = "ip-10-20-20-139.us-east-2.compute.internal"
      + private_ip           = "10.20.20.139"
      + tags                 = {}
        # (8 unchanged attributes hidden)
    }

  # aws_eip.nat_gateway[2] has changed
  ~ resource "aws_eip" "nat_gateway" {
      + association_id       = "eipassoc-0bc3134822c73cc67"
        id                   = "eipalloc-09380b1b234ec78f2"
      + network_interface    = "eni-0c7df52917a5ad6d8"
      + private_dns          = "ip-10-20-20-165.us-east-2.compute.internal"
      + private_ip           = "10.20.20.165"
      + tags                 = {}
        # (8 unchanged attributes hidden)
    }

  # aws_nat_gateway.public[0] has changed
  ~ resource "aws_nat_gateway" "public" {
        id                                 = "nat-00e868220f3c94c89"
      + secondary_allocation_ids           = []
        tags                               = {
            "Name" = "app-2-NAT-1"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_nat_gateway.public[1] has changed
  ~ resource "aws_nat_gateway" "public" {
        id                                 = "nat-0fe0b0d001a5871fe"
      + secondary_allocation_ids           = []
        tags                               = {
            "Name" = "app-2-NAT-2"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_nat_gateway.public[2] has changed
  ~ resource "aws_nat_gateway" "public" {
        id                                 = "nat-0a241b02803ccc546"
      + secondary_allocation_ids           = []
        tags                               = {
            "Name" = "app-2-NAT-3"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0a0b4e1d09784c628"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-00e868220f3c94c89"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "app-2-route-table-1"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_route_table.private[1] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0a7e726f16b4cc889"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0fe0b0d001a5871fe"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "app-2-route-table-2"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_route_table.private[2] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0e27ce3d9726e02ec"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0a241b02803ccc546"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "app-2-route-table-3"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_default_security_group.default must be replaced
-/+ resource "aws_default_security_group" "default" {
      ~ arn                    = "arn:aws:ec2:us-east-2:113597678832:security-group/sg-08abc0f49d5940833" -> (known after apply)
      ~ description            = "default VPC security group" -> (known after apply)
      ~ id                     = "sg-08abc0f49d5940833" -> (known after apply)
      ~ name                   = "default" -> (known after apply)
      + name_prefix            = (known after apply)
      ~ owner_id               = "113597678832" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-02e8698509de39652" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_instance.app-server[0] must be replaced
-/+ resource "aws_instance" "app-server" {
      ~ arn                                  = "arn:aws:ec2:us-east-2:113597678832:instance/i-0f9cff72ccef9da75" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-2a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0f9cff72ccef9da75" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0d6a6d900364a9d6f" -> (known after apply)
      ~ private_dns                          = "ip-10-20-20-29.us-east-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.20.20.29" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-0265bac2e1e396c80" -> (known after apply) # forces replacement
        tags                                 = {
            "Name" = "app-2-server-1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-00e597f240fa7809d",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-09c22cf6b0352ddc8" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.app-server[1] must be replaced
-/+ resource "aws_instance" "app-server" {
      ~ arn                                  = "arn:aws:ec2:us-east-2:113597678832:instance/i-076975b562ef20c5f" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-2b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-076975b562ef20c5f" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0f620c19d1f42579b" -> (known after apply)
      ~ private_dns                          = "ip-10-20-20-54.us-east-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.20.20.54" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-062124640ef9edadf" -> (known after apply) # forces replacement
        tags                                 = {
            "Name" = "app-2-server-2"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-00e597f240fa7809d",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0ff7001a41141aca8" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.app-server[2] must be replaced
-/+ resource "aws_instance" "app-server" {
      ~ arn                                  = "arn:aws:ec2:us-east-2:113597678832:instance/i-0d287ecf7b97c91bc" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-2c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0d287ecf7b97c91bc" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0b2236876013a62a3" -> (known after apply)
      ~ private_dns                          = "ip-10-20-20-92.us-east-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.20.20.92" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-00b6ba38fa092a8df" -> (known after apply) # forces replacement
        tags                                 = {
            "Name" = "app-2-server-3"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-00e597f240fa7809d",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0a87576a3a2423272" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_internet_gateway.this-igw will be updated in-place
  ~ resource "aws_internet_gateway" "this-igw" {
        id       = "igw-02e737728ec32f4a1"
        tags     = {
            "Name" = "app-2-gateway"
        }
      ~ vpc_id   = "vpc-02e8698509de39652" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lb.front will be updated in-place
  ~ resource "aws_lb" "front" {
        id                                          = "arn:aws:elasticloadbalancing:us-east-2:113597678832:loadbalancer/app/app-2-front/8b2bea3789d0055b"
        name                                        = "app-2-front"
      ~ security_groups                             = [
          - "sg-0c7778f9d8eb60bc6",
        ] -> (known after apply)
      ~ subnets                                     = [
          - "subnet-0759ecad3049b4f3f",
          - "subnet-0d567ae41531d833e",
          - "subnet-0f82694406ebba720",
        ] -> (known after apply)
        tags                                        = {
            "Environment" = "Development"
        }
        # (20 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lb_listener.front_end will be updated in-place
  ~ resource "aws_lb_listener" "front_end" {
        id                = "arn:aws:elasticloadbalancing:us-east-2:113597678832:listener/app/app-2-front/8b2bea3789d0055b/8c208f89eb2502bc"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:113597678832:targetgroup/app-2-front/849b90ee9a926f24" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.front must be replaced
-/+ resource "aws_lb_target_group" "front" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-2:113597678832:targetgroup/app-2-front/849b90ee9a926f24" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/app-2-front/849b90ee9a926f24" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-2:113597678832:targetgroup/app-2-front/849b90ee9a926f24" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "app-2-front"
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      ~ vpc_id                             = "vpc-02e8698509de39652" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }

      ~ target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group_attachment.attach-app1[0] must be replaced
-/+ resource "aws_lb_target_group_attachment" "attach-app1" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-2:113597678832:targetgroup/app-2-front/849b90ee9a926f24-20230816163850990500000007" -> (known after apply)
      ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:113597678832:targetgroup/app-2-front/849b90ee9a926f24" -> (known after apply) # forces replacement
      ~ target_id        = "i-0f9cff72ccef9da75" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.attach-app1[1] must be replaced
-/+ resource "aws_lb_target_group_attachment" "attach-app1" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-2:113597678832:targetgroup/app-2-front/849b90ee9a926f24-20230816163851229500000009" -> (known after apply)
      ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:113597678832:targetgroup/app-2-front/849b90ee9a926f24" -> (known after apply) # forces replacement
      ~ target_id        = "i-076975b562ef20c5f" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.attach-app1[2] must be replaced
-/+ resource "aws_lb_target_group_attachment" "attach-app1" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-2:113597678832:targetgroup/app-2-front/849b90ee9a926f24-20230816163851173400000008" -> (known after apply)
      ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:113597678832:targetgroup/app-2-front/849b90ee9a926f24" -> (known after apply) # forces replacement
      ~ target_id        = "i-0d287ecf7b97c91bc" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_nat_gateway.public[0] must be replaced
-/+ resource "aws_nat_gateway" "public" {
      ~ association_id                     = "eipassoc-08f78f62cf18dd9ff" -> (known after apply)
      ~ id                                 = "nat-00e868220f3c94c89" -> (known after apply)
      ~ network_interface_id               = "eni-08fa06db25500cc13" -> (known after apply)
      ~ private_ip                         = "10.20.20.122" -> (known after apply)
      ~ public_ip                          = "3.22.156.54" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-0f82694406ebba720" -> (known after apply) # forces replacement
        tags                               = {
            "Name" = "app-2-NAT-1"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_nat_gateway.public[1] must be replaced
-/+ resource "aws_nat_gateway" "public" {
      ~ association_id                     = "eipassoc-0f9deebe37533ebc2" -> (known after apply)
      ~ id                                 = "nat-0fe0b0d001a5871fe" -> (known after apply)
      ~ network_interface_id               = "eni-0e360c9517425ad88" -> (known after apply)
      ~ private_ip                         = "10.20.20.139" -> (known after apply)
      ~ public_ip                          = "3.132.165.7" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-0d567ae41531d833e" -> (known after apply) # forces replacement
        tags                               = {
            "Name" = "app-2-NAT-2"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_nat_gateway.public[2] must be replaced
-/+ resource "aws_nat_gateway" "public" {
      ~ association_id                     = "eipassoc-0bc3134822c73cc67" -> (known after apply)
      ~ id                                 = "nat-0a241b02803ccc546" -> (known after apply)
      ~ network_interface_id               = "eni-0c7df52917a5ad6d8" -> (known after apply)
      ~ private_ip                         = "10.20.20.165" -> (known after apply)
      ~ public_ip                          = "18.220.175.117" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-0759ecad3049b4f3f" -> (known after apply) # forces replacement
        tags                               = {
            "Name" = "app-2-NAT-3"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_route.internet-route must be replaced
-/+ resource "aws_route" "internet-route" {
      ~ id                     = "r-rtb-00a9ac541bed394ee1080289494" -> (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      ~ origin                 = "CreateRoute" -> (known after apply)
      ~ route_table_id         = "rtb-00a9ac541bed394ee" -> (known after apply) # forces replacement
      ~ state                  = "active" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_route.private-route[0] must be replaced
-/+ resource "aws_route" "private-route" {
      + gateway_id             = (known after apply)
      ~ id                     = "r-rtb-0a0b4e1d09784c6281080289494" -> (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      - nat_gateway_id         = "nat-00e868220f3c94c89" -> null
      + network_interface_id   = (known after apply)
      ~ origin                 = "CreateRoute" -> (known after apply)
      ~ route_table_id         = "rtb-0a0b4e1d09784c628" -> (known after apply) # forces replacement
      ~ state                  = "active" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_route.private-route[1] must be replaced
-/+ resource "aws_route" "private-route" {
      + gateway_id             = (known after apply)
      ~ id                     = "r-rtb-0a7e726f16b4cc8891080289494" -> (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      - nat_gateway_id         = "nat-0fe0b0d001a5871fe" -> null
      + network_interface_id   = (known after apply)
      ~ origin                 = "CreateRoute" -> (known after apply)
      ~ route_table_id         = "rtb-0a7e726f16b4cc889" -> (known after apply) # forces replacement
      ~ state                  = "active" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_route.private-route[2] must be replaced
-/+ resource "aws_route" "private-route" {
      + gateway_id             = (known after apply)
      ~ id                     = "r-rtb-0e27ce3d9726e02ec1080289494" -> (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      - nat_gateway_id         = "nat-0a241b02803ccc546" -> null
      + network_interface_id   = (known after apply)
      ~ origin                 = "CreateRoute" -> (known after apply)
      ~ route_table_id         = "rtb-0e27ce3d9726e02ec" -> (known after apply) # forces replacement
      ~ state                  = "active" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_route_table.private[0] must be replaced
-/+ resource "aws_route_table" "private" {
      ~ arn              = "arn:aws:ec2:us-east-2:113597678832:route-table/rtb-0a0b4e1d09784c628" -> (known after apply)
      ~ id               = "rtb-0a0b4e1d09784c628" -> (known after apply)
      ~ owner_id         = "113597678832" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-00e868220f3c94c89"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> (known after apply)
        tags             = {
            "Name" = "app-2-route-table-1"
        }
      ~ vpc_id           = "vpc-02e8698509de39652" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table.private[1] must be replaced
-/+ resource "aws_route_table" "private" {
      ~ arn              = "arn:aws:ec2:us-east-2:113597678832:route-table/rtb-0a7e726f16b4cc889" -> (known after apply)
      ~ id               = "rtb-0a7e726f16b4cc889" -> (known after apply)
      ~ owner_id         = "113597678832" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0fe0b0d001a5871fe"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> (known after apply)
        tags             = {
            "Name" = "app-2-route-table-2"
        }
      ~ vpc_id           = "vpc-02e8698509de39652" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table.private[2] must be replaced
-/+ resource "aws_route_table" "private" {
      ~ arn              = "arn:aws:ec2:us-east-2:113597678832:route-table/rtb-0e27ce3d9726e02ec" -> (known after apply)
      ~ id               = "rtb-0e27ce3d9726e02ec" -> (known after apply)
      ~ owner_id         = "113597678832" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0a241b02803ccc546"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> (known after apply)
        tags             = {
            "Name" = "app-2-route-table-3"
        }
      ~ vpc_id           = "vpc-02e8698509de39652" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table.public must be replaced
-/+ resource "aws_route_table" "public" {
      ~ arn              = "arn:aws:ec2:us-east-2:113597678832:route-table/rtb-00a9ac541bed394ee" -> (known after apply)
      ~ id               = "rtb-00a9ac541bed394ee" -> (known after apply)
      ~ owner_id         = "113597678832" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-02e737728ec32f4a1"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> (known after apply)
        tags             = {
            "Name" = "app-2-public"
        }
      ~ vpc_id           = "vpc-02e8698509de39652" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.private[0] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-0b7df31e6dd2b2690" -> (known after apply)
      ~ route_table_id = "rtb-0a0b4e1d09784c628" -> (known after apply)
      ~ subnet_id      = "subnet-0265bac2e1e396c80" -> (known after apply) # forces replacement
    }

  # aws_route_table_association.private[1] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-019a012cbc45f9164" -> (known after apply)
      ~ route_table_id = "rtb-0a7e726f16b4cc889" -> (known after apply)
      ~ subnet_id      = "subnet-062124640ef9edadf" -> (known after apply) # forces replacement
    }

  # aws_route_table_association.private[2] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-03f0c26928f367b7a" -> (known after apply)
      ~ route_table_id = "rtb-0e27ce3d9726e02ec" -> (known after apply)
      ~ subnet_id      = "subnet-00b6ba38fa092a8df" -> (known after apply) # forces replacement
    }

  # aws_route_table_association.public[0] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-0befedf51da8fca9c" -> (known after apply)
      ~ route_table_id = "rtb-00a9ac541bed394ee" -> (known after apply)
      ~ subnet_id      = "subnet-0f82694406ebba720" -> (known after apply) # forces replacement
    }

  # aws_route_table_association.public[1] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-0aa93cc269c592eef" -> (known after apply)
      ~ route_table_id = "rtb-00a9ac541bed394ee" -> (known after apply)
      ~ subnet_id      = "subnet-0d567ae41531d833e" -> (known after apply) # forces replacement
    }

  # aws_route_table_association.public[2] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-0445ff0baa05809e6" -> (known after apply)
      ~ route_table_id = "rtb-00a9ac541bed394ee" -> (known after apply)
      ~ subnet_id      = "subnet-0759ecad3049b4f3f" -> (known after apply) # forces replacement
    }

  # aws_security_group.ec2_instance must be replaced
-/+ resource "aws_security_group" "ec2_instance" {
      ~ arn                    = "arn:aws:ec2:us-east-2:113597678832:security-group/sg-00e597f240fa7809d" -> (known after apply)
      ~ id                     = "sg-00e597f240fa7809d" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0c7778f9d8eb60bc6",
                ]
              - self             = false
              - to_port          = 80
            },
            # (1 unchanged element hidden)
        ]
        name                   = "App-2-IN-SG"
      + name_prefix            = (known after apply)
      ~ owner_id               = "113597678832" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-02e8698509de39652" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_security_group.lb must be replaced
-/+ resource "aws_security_group" "lb" {
      ~ arn                    = "arn:aws:ec2:us-east-2:113597678832:security-group/sg-0c7778f9d8eb60bc6" -> (known after apply)
      ~ id                     = "sg-0c7778f9d8eb60bc6" -> (known after apply)
        name                   = "App-2-LB-SG"
      + name_prefix            = (known after apply)
      ~ owner_id               = "113597678832" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-02e8698509de39652" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_subnet.private[0] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:113597678832:subnet/subnet-0265bac2e1e396c80" -> (known after apply)
      ~ availability_zone_id                           = "use2-az1" -> (known after apply)
      ~ cidr_block                                     = "10.20.20.0/27" -> "129.87.10.0/27" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0265bac2e1e396c80" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "113597678832" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "app-2-private-1"
        }
      ~ vpc_id                                         = "vpc-02e8698509de39652" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.private[1] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:113597678832:subnet/subnet-062124640ef9edadf" -> (known after apply)
      ~ availability_zone_id                           = "use2-az2" -> (known after apply)
      ~ cidr_block                                     = "10.20.20.32/27" -> "129.87.10.32/27" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-062124640ef9edadf" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "113597678832" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "app-2-private-2"
        }
      ~ vpc_id                                         = "vpc-02e8698509de39652" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.private[2] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:113597678832:subnet/subnet-00b6ba38fa092a8df" -> (known after apply)
      ~ availability_zone_id                           = "use2-az3" -> (known after apply)
      ~ cidr_block                                     = "10.20.20.64/27" -> "129.87.10.64/27" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-00b6ba38fa092a8df" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "113597678832" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "app-2-private-3"
        }
      ~ vpc_id                                         = "vpc-02e8698509de39652" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public[0] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:113597678832:subnet/subnet-0f82694406ebba720" -> (known after apply)
      ~ availability_zone_id                           = "use2-az1" -> (known after apply)
      ~ cidr_block                                     = "10.20.20.96/27" -> "129.87.10.96/27" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0f82694406ebba720" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "113597678832" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "app-2-public-1"
        }
      ~ vpc_id                                         = "vpc-02e8698509de39652" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public[1] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:113597678832:subnet/subnet-0d567ae41531d833e" -> (known after apply)
      ~ availability_zone_id                           = "use2-az2" -> (known after apply)
      ~ cidr_block                                     = "10.20.20.128/27" -> "129.87.10.128/27" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0d567ae41531d833e" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "113597678832" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "app-2-public-2"
        }
      ~ vpc_id                                         = "vpc-02e8698509de39652" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public[2] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:113597678832:subnet/subnet-0759ecad3049b4f3f" -> (known after apply)
      ~ availability_zone_id                           = "use2-az3" -> (known after apply)
      ~ cidr_block                                     = "10.20.20.160/27" -> "129.87.10.160/27" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0759ecad3049b4f3f" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "113597678832" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "app-2-public-3"
        }
      ~ vpc_id                                         = "vpc-02e8698509de39652" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_vpc.this must be replaced
-/+ resource "aws_vpc" "this" {
      ~ arn                                  = "arn:aws:ec2:us-east-2:113597678832:vpc/vpc-02e8698509de39652" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.20.20.0/24" -> "129.87.10.0/24" # forces replacement
      ~ default_network_acl_id               = "acl-0ebdf5dd287cb2927" -> (known after apply)
      ~ default_route_table_id               = "rtb-01b67b1fcb94ceda0" -> (known after apply)
      ~ default_security_group_id            = "sg-08abc0f49d5940833" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-0c7b94fde7bedbe68" -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-02e8698509de39652" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-01b67b1fcb94ceda0" -> (known after apply)
      ~ owner_id                             = "113597678832" -> (known after apply)
        tags                                 = {
            "Name" = "app-2"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 34 to add, 3 to change, 34 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*